app/controllers/home_controller.rb

SELECT COUNT(*) FROM "recipes"
SELECT  "recipes".* FROM "recipes"  ORDER BY "recipes"."id" DESC LIMIT 1
---
def index
@number_of_recipes = Recipe.count
@latest_recipe = Recipe.last